import React from "react";
import { Typography, Container, List, ListItem } from "@mui/material";

const Guarantee = () => {
	return (
		<Container>
			<Typography variant="h5">Гарантійні зобовязання не поширюється на Товар у разі:</Typography>
			<List
				sx={{
					color: "grey",
					fontFamily: "Open Sans, sans-serif",
					fontSize: "14px",
					fontWeight: "fontWeightRegular",
					padding: "0 0 40px 0",
				}}
			>
				<ListItem divider={true}>випадкового пошкодження (дефекти завдані клієнтом);</ListItem>
				<ListItem divider={true}>пошкодження в результаті стихійних лих (природних явищ);</ListItem>
				<ListItem divider={true}>
					пошкодження, що виникли внаслідок недбалого ставлення або використання (недотримання
					температурного режиму, вплив рідини, запиленості, механічні пошкодження, попадання
					всередину корпусу сторонніх предметів);
				</ListItem>
				<ListItem divider={true}>
					пошкодження, викликані аварійним підвищенням або пониженням напруги в мережі;
				</ListItem>
				<ListItem divider={true}>
					пошкодження або ненормальне функціонування виробу, спричинене збоями або невідповідністю
					стандартам параметрів живлення, телекомунікаційних, кабельних та інших подібних зовнішніх
					факторів;
				</ListItem>
				<ListItem divider={true}>
					пошкодження, викликані дефектами системи, в якій використовувався даний товар, або що
					виникли в результаті зєднання і підключення товару до інших виробів;
				</ListItem>
				<ListItem divider={true}>
					пошкодження, викликані використанням товару не за призначенням або з порушенням правил
					експлуатації;
				</ListItem>
				<ListItem divider={true}>
					природний знос елементів у випадках перевищення зазначених норм експлуатації;
				</ListItem>
				<ListItem divider={true}>
					пошкодження або ненормальне функціонування товару, викликане завантаженими програмами;
				</ListItem>
				<ListItem divider={true}>
					пошкодження або ненормальне функціонування виробу, спричинене використанням нестандартних
					та (або) неякісних витратних матеріалів, приладдя, запасних частин, елементів живлення
					тощо;
				</ListItem>
				<ListItem divider={true}>
					наявності на виробі ознак ремонту не уповноваженими особами;
				</ListItem>
				<ListItem divider={true}>
					на програмні продукти, що поставляються разом із виробом;
				</ListItem>
				<ListItem divider={true}>
					на програмні продукти, які не поставляються разом із виробом;
				</ListItem>
				<ListItem divider={true}>
					на дані користувача, що зберігаються або отримані за допомогою виробу.
				</ListItem>
			</List>
		</Container>
	);
};

export default Guarantee;
